In [11]:
# import necessary libraries
import pandas as pd
import numpy as np
import plotly.graph_objects as go

In [12]:
# load and read dataset
dataset = pd.read_csv('Bengaluru_House_Data.xls')
dataset.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [13]:
# shape of dataset
dataset.shape

(13320, 9)

In [14]:
# all the columns
dataset.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [15]:
# find aggregate of area type column
dataset.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [16]:
# drop the columns that might not be necessary
dataset1 = dataset.drop(columns = ['area_type', 'availability', 'society'])
dataset1.head()

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [17]:
# describe the dataset
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   balcony     12711 non-null  float64
 5   price       13320 non-null  float64
dtypes: float64(3), object(3)
memory usage: 624.5+ KB

In [18]:
# find null values if any in the dataset
dataset1.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [19]:
# drop all the null values as they are quite small in number compared to the whole dataset
dataset1['balcony'] = dataset1['balcony'].dropna()

In [20]:
dataset1.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [21]:
# remove all the null values from the balcony column
dataset1 = dataset1.dropna(subset = ['balcony'])
dataset1.isnull().sum()

location      1
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [22]:
# now remove all the null values from location column
dataset1 = dataset1.dropna(subset = ['location'])
dataset1.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [23]:
# now find datatypes of all columns
dataset1.dtypes

location       object
size           object
total_sqft     object
bath          float64
balcony       float64
price         float64
dtype: object

In [28]:
# check all the object columns
len(dataset1.location.unique())

1265

In [33]:
# check all the unique values in size column
dataset1['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '3 Bedroom', '1 BHK', '1 RK',
       '4 BHK', '1 Bedroom', '2 Bedroom', '6 Bedroom', '8 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '11 Bedroom', '43 Bedroom',
       '14 BHK', '8 BHK', '12 Bedroom', '10 Bedroom', '13 BHK'],
      dtype=object)

In [34]:
# convert size column to int as it is number of rooms
dataset1['no_rooms'] = dataset1['size'].apply(lambda x: int(x.split(' ')[0]))
dataset1.head()

,location,size,total_sqft,bath,balcony,price,no_rooms
0,Electronic City Phase II,2 BHK,1056,2.0,1.0,39.07,2
1,Chikka Tirupathi,4 Bedroom,2600,5.0,3.0,120.00,4
2,Uttarahalli,3 BHK,1440,2.0,3.0,62.00,3
3,Lingadheeranahalli,3 BHK,1521,3.0,1.0,95.00,3
4,Kothanur,2 BHK,1200,2.0,1.0,51.00,2

In [35]:
dataset1.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
no_rooms      0
dtype: int64

In [36]:
# find the datatypes again
dataset1.dtypes

location       object
size           object
total_sqft     object
bath          float64
balcony       float64
price         float64
no_rooms        int64
dtype: object

In [37]:
# drop size column as we don't need it
dataset1 = dataset1.drop(columns = ['size'])
dataset1.head()

                   location total_sqft  bath  balcony   price  no_rooms
0  Electronic City Phase II       1056   2.0      1.0   39.07         2
1          Chikka Tirupathi       2600   5.0      3.0  120.00         4
2               Uttarahalli       1440   2.0      3.0   62.00         3
3        Lingadheeranahalli       1521   3.0      1.0   95.00         3
4                  Kothanur       1200   2.0      1.0   51.00         2

In [38]:
# find unique values in balcony
dataset1['balcony'].unique()

array([1., 3., 2., 0.])

In [39]:
# now find unique values in no of rooms
dataset1['no_rooms'].unique()

array([ 2,  4,  3,  1,  6,  8,  7,  5, 11,  9, 27, 43, 14, 12, 10, 13],
      dtype=int64)

In [40]:
# find the details of apartments that contain more than 20 rooms
dataset1[dataset1.no_rooms > 20]

                       location total_sqft  bath  balcony  price  no_rooms
1718  2Electronic City Phase II       8000  27.0      0.0  230.0        27
4684                Munnekollal       2400  40.0      0.0  660.0        43

In [42]:
# again find all the datatypes
dataset1.dtypes

location       object
total_sqft     object
bath          float64
balcony       float64
price         float64
no_rooms        int64
dtype: object

In [43]:
# now lets explore total square feet column
dataset1['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [47]:
# now write a function to convert each value in total square column into float
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [51]:
# apply the function created above on the column: total square
dataset1[~dataset['total_sqft'].apply(is_float)]

C:\Users\Arfan Shah\AppData\Local\Temp\ipykernel_2328\1697706780.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  dataset1[~dataset['total_sqft'].apply(is_float)]

                 location   total_sqft  bath  balcony    price  no_rooms
30              Yelahanka  2100 - 2850   4.0      0.0  186.000         4
122                Hebbal  3067 - 8156   4.0      0.0  477.000         4
137    8th Phase JP Nagar  1042 - 1105   2.0      0.0   54.005         2
165              Sarjapur  1145 - 1340   2.0      0.0   43.490         2
188              KR Puram  1015 - 1540   2.0      0.0   56.800         2
...                   ...          ...   ...      ...      ...       ...
12975          Whitefield   850 - 1060   2.0      0.0   38.190         2
12990      Talaghattapura  1804 - 2273   3.0      0.0  122.000         3
13059              Harlur  1200 - 1470   2.0      0.0   72.760         2
13265               Hoodi  1133 - 1384   2.0      0.0   59.135         2
13299          Whitefield  2830 - 2882   5.0      0.0  154.500         4

[186 rows x 6 columns]